app/controllers/admin/companies_controller.rb

    def create
      @company = Company.new(params[:company])
      if @company.save
---
INSERT INTO "companies" ("title", "body", "meta_title", "meta_keyword", "meta_desc", "created_at", "updated_at") VALUES ('Our blog', 'Aenean viverra, libero sed luctus commodo, metus nunc ultricies nisi, ut pretium lacus est vel erat. Nunc gravida pulvinar lectus, sit amet gravida neque rhoncus sed. Donec gravida placerat laoreet. Vivamus malesuada nunc eu magna tristique consectetur posuere libero vestibulum. Sed malesuada sapien vel ipsum cursus posuere vel eu sapien. Sed vitae est a ante molestie suscipit ut eget erat. Vestibulum quis lectus urna, vitae accumsan turpis. Donec metus orci, lacinia vitae accumsan at, ultricies ac arcu. Aenean et laoreet ante. Aenean vestibulum, justo eget mattis commodo, elit dolor pellentesque velit, eget varius massa velit in dolor. Nunc sed ante mauris, ut sodales felis. Cras sit amet urna tellus, nec interdum elit.

    def update
      @company = Company.find(params[:id])
      if @company.update_attributes(params[:company])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
UPDATE "companies" SET "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Praesent nec orci est, cursus varius massa. Aliquam erat volutpat. In non iaculis ipsum. Aenean viverra, libero sed luctus commodo, metus nunc ultricies nisi, ut pretium lacus est vel erat. Nunc gravida pulvinar lectus, sit amet gravida neque rhoncus sed. Donec gravida placerat laoreet. Vivamus malesuada nunc eu magna tristique consectetur posuere libero vestibulum. Sed malesuada sapien vel ipsum cursus posuere vel eu sapien. Sed vitae est a ante molestie suscipit ut eget erat. Vestibulum quis lectus urna, vitae accumsan turpis. Donec metus orci, lacinia vitae accumsan at, ultricies ac arcu. Aenean et laoreet ante. Aenean vestibulum, justo eget mattis commodo, elit dolor pellentesque velit, eget varius massa velit in dolor. Nunc sed ante mauris, ut sodales felis. Cras sit amet urna tellus, nec interdum elit.