app/controllers/admin/services_controller.rb

    def create
      @service = Service.new(params[:service])
      if @service.save
---
INSERT INTO "services" ("title", "body", "meta_title", "meta_keyword", "meta_desc", "created_at", "updated_at") VALUES ('Web Programming', 'sit amet vestibulum diam ante sed felis. Nunc sed iaculis leo. Morbi id enim ipsum. Aliquam viverra tincidunt turpis id sagittis. Sed luctus risus sit amet velit pellentesque eu tincidunt sapien auctor. Vivamus est lectus, egestas sit amet tincidunt nec, viverra at sem. Morbi a velit lectus. Phasellus ac ante sed tortor pulvinar elementum.

    def edit
      @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = 1 LIMIT 1

    def update
      @service = Service.find(params[:id])
      if @service.update_attributes(params[:service])
---
SELECT "services".* FROM "services" WHERE "services"."id" = 1 LIMIT 1
UPDATE "services" SET "body" = 'Nulla blandit, lacus et congue pharetra, velit erat vehicula leo, sit amet vestibulum diam ante sed felis. Nunc sed iaculis leo. Morbi id enim ipsum. Aliquam viverra tincidunt turpis id sagittis. Sed luctus risus sit amet velit pellentesque eu tincidunt sapien auctor. Vivamus est lectus, egestas sit amet tincidunt nec, viverra at sem. Morbi a velit lectus. Phasellus ac ante sed tortor pulvinar elementum.