app/controllers/home_controller.rb

	def contact
		if request.post? and params[:contact]
    	      if contact = Contact.new(params[:contact])

    	        contact.name = "#{params[:contact][:name]}"
    	        contact.address = "#{params[:contact][:address]}"
    	        contact.subject = "#{params[:contact][:subject]}"
    	        contact.message = "#{params[:contact][:message]}"
    	        if contact.save
---
INSERT INTO "contacts" ("name", "address", "subject", "message", "created_at", "updated_at") VALUES ('Rahul', 'rahul@gmail.com', 'testing', 'testing side', '2011-11-08 16:50:45.619641', '2011-11-08 16:50:45.619641')